Courses/7140/Lectures/Overview/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CS7140 Course Overview</title>
<!-- 2018-05-08 Tue 06:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CS7140 Course Overview</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Course Goals</h2>
<div class="outline-text-2" id="text-1">
<p>
To enable you to
</p>

<ol class="org-ol">
<li>Develop, individually, a 1000+ lines program with great confidence.
No bugs.  Well written Requirements, Specs, Design, Implementation,
and Testing documents.
</li>
<li>Practice with the best open source tools.
</li>
<li>Be fluent in Java/Kotlin and C++, and become aware of newer
programming languages.
</li>
<li>Comprehend research literature.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Prerequisites</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>CEG 4110 intro to Software Engineering and CS 3100 Data Structures
and Algorithms.  Ignore the CS/CEG prefixes. Without the above two
courses (or their equivalent) you will find this course near
impossible.  More details at <a href="./7140-syllabus.html">./7140-syllabus.html</a>
</li>

<li>It is also expected that you are (i) fluent in Java and/or C++, and
(ii) comfortable developing programs using IntelliJ Idea, or
Eclipse.
</li>

<li>Be able to: Define/Describe {Requirements, Specifications, Design,
Implementation and Testing}.
</li>

<li>Typical deficiency: Grammars (BNF notation), Discrete Math, Logic.
We will fill you in on these.
</li>

<li>Quick survey: See below
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Accounts</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The practical work of this course can be done on Linux or Windows.
I recommend Linux.
</li>
<li>CECS Account <code>thor.cs.wright.edu</code>
<ol class="org-ol">
<li>This is a large Linux server. Intel Xeon 24 core CPU
X5680, 132 GB RAM, etc.
</li>
<li>Unless you have a "named" account (not cs7140xy), your files
will be wiped out soon after the finals.
</li>
<li>All work needs to be submitted using <code>~cs714000/turnin</code>
</li>
</ol>
</li>

<li>WSU Account <code>unixapps1.wright.edu</code>
<ol class="org-ol">
<li>As a student of WSU, you have an account (named as in w123abc)
on this Linux server.
</li>
<li>You can set up your own web site on this machine in the
directory <code>~/www/</code>
</li>
<li>Read <a href="https://www.wright.edu/information-technology/">https://www.wright.edu/information-technology/</a>
</li>
</ol>
</li>

<li>These two machines do not share userids or passwords.
</li>

<li><a href="http://piazza.com/wright/%20*%20%20/cs7140">http://piazza.com/wright/%20*%20%20/cs7140</a>  Please enroll.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Course Content</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Course Home Page: <a href="http://www.cs.wright.edu/~pmateti/Courses/7140/Top/">CS 7140: Advanced Software Engineering</a> Visit
often.  Read the syllabus.  Full attendance is expected.
</li>
</ol>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Our Programming Languages</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li><a href="../Languages">../Languages</a> C++14
</li>
<li><a href="../Languages">../Languages</a> Java8 + JavaFX
</li>
<li>Language Popularity Surveys

<ol class="org-ol">
<li><a href="http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html">http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html</a>
</li>
<li><a href="http://spectrum.ieee.org/computing/software/the-2015-top-ten-programming-languages">http://spectrum.ieee.org/computing/software/the-2015-top-ten-programming-languages</a>
</li>
<li><a href="http://stackoverflow.com/research/developer-survey-2015">http://stackoverflow.com/research/developer-survey-2015</a>
</li>
</ol>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Expected Work</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Two Homeworks, Two Exams, One Team Project
</li>

<li>Exams are on online/ take-home &#x2013; tool use permitted.  &#x2013; but not
for surfing for answers.  High expectations of honor code.
</li>

<li><a href="http://cecs.wright.edu/~pmateti/Courses/7140/Projects/7140-project.html">Course Project</a>
</li>

<li>Team Formation Due date: eof this week.  Post on Pilot your team
details.
</li>

<li>Links to previous HW, Exams, Project are on the course home page.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Survey</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>Please take the <a href="./survey.html">survey</a>.
</li>
<li>Please submit the prerequisites survey
</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> State of Software Engineering</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="./state-of-SE.html">./state-of-SE.html</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<p>
Reading list for this course is a transitive closure starting from the
ones linked on the course home page. Items marked as Require Reading
are sources for exam questions. Other items do enhance your
understanding, but, if you are not aiming for an A, you may skip.
</p>

<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../">All My Lecture Notes</a>, 2016.
Required Reading.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-04-28
</div>
</body>
</html>
